results/run007/0/U.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volVectorField;
    object      U.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../input"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 1e-4 0);

boundaryField
{
    /*inlet
    {
        type               fixedValue;
        value              $Uinlet;
    }*/
    
    inlet
    {
        type               flowRateInletVelocity;
        massFlowRate       $massFlowIn;
        rhoInlet           1.185;
        rho                rho;
        value              uniform (0 0 0);
    }
    
    outlet
    {
        type               pressureInletOutletVelocity;
        phi                phi.air;
        value              $internalField;
    }
    walls
    {
        type               fixedValue;
        value              uniform (0 0 0);
    }
}

// ************************************************************************* //
